stud = ["aня","ваня"]
sub = ["физика","русский"]
grade = [5,4]
for a,b,c in zip(stud,sub,grade):
    print(a,"-",b,"-",c)
g = [100]
c = [10]
for a,b in zip(g,c):
    print(a*(100-b)/100)
res = [a*(100-b)/100 for a,b in zip(g,c)]
k = ["name","age"]
z = ["иван",""]
c = []
for a,b in zip(k,z):
    c.append({a:b})
for s,f in enumerate(c):
    print(s,f)
for i,(l,m) in enumerate(zip(k,z)):
    print(i,f"{l}:{m}")

with open("1711.txt")as f:
    line = list(map(int,f))
m = max(line)
print(m)
l= []
for a,b,c in zip(line,line[1:],line[2:]):
    if (a%10!=3 and b%10!=3 and c%10!=3) and (a**2 + b**2 + c**2)>m:
        l.append(a**2 + b**2 + c**2)
print(len(l),max(l))
#  файле 1714.txt содержится последовательность целых чисел.
# Её элементы могут принимать целые значения от -100000 до 100000 включительно.
#
# Определите количество троек элементов последовательности,
# в которых не более двух из трёх элементов являются четырёхзначными числами,
# а сумма элементов тройки не больше максимального элемента последовательности, оканчивающегося на 25.
#
# В ответе запишите количество найденных троек чисел,
# затем максимальную из сумм элементов таких троек.
# В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.
with open("1714.txt")as f:
    line = list(map(int,f))
p= max(i for i in line if abs(i)%100==25)
l = []
for a,b,c in zip(line,line[1:],line[2:]):
    n = 0
    if 999<abs(a)<10000:
        n+=1
    if 999<abs(b)<10000:
        n+=1
    if 999 <abs(c)< 10000:
        n += 1
    if n<=2 and (a+b+c)<=p:
        l.append(a+b+c)
print(len(l),max(l))
# В файле 1717.txt содержится последовательность целых чисел.
# Её элементы могут принимать целые значения от -100 000 до 100 000 включительно.
#
# Определите количество троек элементов последовательности,
# в которых не более двух из трёх элементов являются двузначными числами,
# а сумма элементов тройки не превосходит сумму минимального двузначного
# и максимального двузначного элементов последовательности.
#
# В ответе запишите количество найденных троек чисел,
# затем максимальную из сумм элементов таких троек.
# В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.
with open("1717.txt")as f:
    line = list(map(int,f))
maxx = max(i for i in line if 9<abs(i)<100)
minn = min(i for i in line if 9<abs(i)<100)
s = (maxx)+(minn)
l = []
for a,b,c in zip(line,line[1:],line[2:]):
    n = 0
    if 9 < abs(a) < 100:
        n += 1
    if 99 < abs(b) < 100:
        n += 1
    if 9 < abs(c) < 100:
        n += 1
    if n <= 2 and (a+b+c)<=s:
        l.append(a + b + c)
print(len(l), max(l))

