# Пользователем вводятся два числа одной строкой через пробел
# К первому числу прибавляется второе число, умноженное на 3
# От второго числа отнимается остаток от деления первого числа на 2
# Оба полученных числа в шагах 2 и 3 выводятся на экра
# a= input())
# l = list(map(int,a.split(""))
# c= l[0]+ (3*l[1])
# print(c)
# d = l[1]- (l[0] % 2)
# print(d)
# Пользователем вводится число в диапазоне от 100 до 999
# Если число заканчивается нечётной цифрой или начинается с чётной, то к введённому числу прибавляется 1
# Иначе если число начинается с любой из цифр: 3, 7, 9, то от введённого числа отнимается 1
# Во всех остальных случаях число выводится на экран без изменений
# a = int(input())
# c = a//100
# if a % 2!=0 or c%2==0:
#     a+=1
# elif: a//100 == 3 or a//100 == 7 or a//100 == 9:
#     a=a-1
# print(a)
# # Есть функция вида y=f(x):
#
# y=3x+1, при x>0
#
# y=x, при x=0
#
# y=x2+2, при x<0
#
# Напишите программу для определения y по введенному с клавиатуры значению x
# x = int(input())
# if x>0:
#     y = 3*x + 1
# elif x == 0:
#     y = x
# elif x <0 :
#     y = 2 * x + 2
# print(y)
# Пользователем вводится целое пятизначное число (проверок не требуется)
# Введённое число раскладывается на разряды
# На экран выводится сумма всех цифр (разрядов) этого числа
# a = int(input())
# a1 = a//10000
# a22 = (a%10000)
# a2 = a22 // 1000
# a33= a%1000
# a3 = a33 //100
# a44 = a%100
# a4 = a44//10
# a5 = a%10
# print(a1+a2+a3+a4+a5)
# a = int(input())
# sm = 0
# while a:
#     s= a%10
#     a = a//10
#     sm+=s
# print(sm)
# a = input()
# l =list(map(int,a))
# print(sum(l))
# Пользователь вводит строку из нескольких слов,
# разделённых пробелом
# На экран выводится строка,
# в которой каждое слово исходной строки стоит в том же порядке, но само слово перевёрнуто
# a = input()
# s= a.split("")
# for i in s:
#      a = i[::-1]
#      print(a,end = " ")
# Пользователем вводится несколько натуральных чисел
# одной строкой через пробел
# Из этих чисел формируется список
# Если среди чисел списка есть хотя бы одно число,
# которое одновременно делится на 13 и является чётным,
# то выведите на экран сумму всех элементов до этого числа.
# Если среди чисел нет ни одного подходящего под условие пункта 3 числа
# — выведите сообщение «Подходящих чисел не найдено»
# a = input()
# l = list(map(int,a.split()))
# c = 0
# for i in l:
#     if i %13==0 and i %2==0:
#         index = a.index(i)
#         print(sum(l[:index]))
#         break
# else: # если не поставвим брейк будет срабатываться каждый раз
#     print("Подходящих чисел не найдено")


