a = "привет мир"
# # первое вхождение символа
# print(a.index("р"))
# # ищем с 4 индекса
# print(a.index("р",4))
#ищем и от 3 до 6 индекса
print(a.index("и",3,6))
# в верхний регистр
print(a.upper())
# в нижний регистр
print(a.lower())
# заканчивается ли строка текущей подстрокой
print(a.endswith("р"))
print(a.startswith("ри",1))
# метод поиска(выводит индекс нахождения подстроки)
print(a.find("ив"))
# начинает с конца искать а не с начла
print(a.rfind())
#
#
a = "hello hello"
print(a.split(" "))# разделяяет строку по выбраному символу например в данном случае по пропуску
print(a.rsplit(" "))
b = ["hello","world"]
# склеит и превратит в строчку
s = " ".join(b)
#убирает выбранный символ с концов строки
s="***243453***3646****"
print(s.strip("*"))
print(s.lstrip("*"))
# заменяет подстроку новой строкой
print(s.replace("***","aaa"))
a = "helloworld"
print(a.isalpha())# тру если все символы строки буквы
a="132425"
print(a.isdigit())# все символы строки цифры
print(a.isalnum())# пофиг буквы или цифры
print(a.islower())# все маленькие буквы
# is всегда тру или фолс
print(a.istitle())# проверяет все слова начинаются ли с заглавной буквы
print(a.isnumeric())# вернет тру даже если цифры арабские дроби и тд
a = "hello world"
#сколько этих символов
print(a.count("h"))