# В магазине для упаковки подарков есть N кубических коробок.
# Самой интересной считается упаковка подарка по принципу матрёшки –
# подарок упаковывается в одну из коробок, та, в свою очередь,
# в другую коробку и т.д. Одну коробку можно поместить в другую,
# если длина её стороны меньше длины стороны другой коробки не
# менее чем на 9 единиц.
# Определите наибольшее количество коробок, которое можно использовать
# для упаковки одного подарка, и максимально возможную длину стороны
# самой маленькой коробки, где будет находиться подарок.
# Размер подарка позволяет поместить его в самую маленькую коробку.
#
# Входные данные
# В первой строке файла 2601 находится число N – количество коробок
# в магазине (натуральное число, не превышающее 10 000). В следующих
# N строках находятся значения длин сторон коробок (все числа натуральные,
# не превышающие 10 000), каждое – в отдельной строке.
#
# Запишите в ответе два целых числа: сначала наибольшее количество коробок,
# которое можно использовать для упаковки одного подарка, затем максимально
# возможную длину стороны самой маленькой коробки в таком наборе
with open("2601.txt")as f:
    N=int(f.readline())
    a = list(map(int,f))
d=sorted(a,reverse=True)
res=[d[0]]
for i in d[1:]:
    if res[-1]-i >=9 :
        res.append(i)
print(len(res),min(res))
# В кондитерской есть N круглых форм для коржей. Специализация кондитерской – многоярусные торты, в которых диаметр каждого
# верхнего коржа меньше диаметра предыдущего. Один корж можно поместить на другой,
# если его диаметр хотя бы на 4 единицы меньше диаметра другого коржа.
#
# Определите наибольшее количество коржей, которое можно использовать для
# создания многоярусного торта, и максимально возможный диаметр самого маленького коржа.
#
# Входные данные
#
# В первой строке входного файла находится число N – количество форм для коржей
# в кондитерской (натуральное число, не превышающее 10 000).
# В следующих N строках находятся значения диаметров форм для коржей
# (все числа натуральные, не превышающие 10 000), каждое – в отдельной строке.
# Диаметр формы равен диаметру коржа, который выпекается в этой в форме.
# Запишите в ответе два целых числа: сначала наибольшее количество коржей,
# которое можно использовать для создания одного многоярусного торта,
# затем – максимально возможный диаметр самого маленького коржа в таком торте.
with open("2607.txt")as f:
    d = f.readline()
    a = list(map(int,f))
c = sorted(a,reverse=True)
maxx= [c[0]]
for i in c[1:]:
    if maxx[-1]-i>=4:
        maxx.append(i)
print(len(maxx),min(maxx))
#
#
# Входной файл содержит сведения о заявках на проведение мероприятий
# в конференц-зале. В каждой заявке указаны время начала и время
# окончания мероприятия (в минутах от начала суток).
#
# Если время начала одного мероприятия меньше времени окончания
# другого, то провести можно только одно из них.
#
# Если время окончания одного мероприятия совпадает со временем
# начала другого, то провести можно оба.
#
# Определите, какое максимальное количество мероприятий
# можно провести в конференц-зале и каков при этом максимально
# возможный перерыв между двумя последними мероприятиями.
#
# Входные данные
#
# В первой строке входного файла находится натуральное число N
# (N ≤ 1000) – количество заявок на проведение мероприятий.
# Следующие N строк содержат пары чисел, обозначающих время
# начала и время окончания мероприятий. Каждое из чисел натуральное,
# не превосходящее 1440.
#
# Запишите в ответе два числа: максимальное количество мероприятий и
# самый длинный перерыв между двумя последними мероприятиями (в минутах).
with open("2607.txt") as f:
    n =int(f.readline())
    c = []
    for i in f:
        a = list(map(int,i.split()))
        k={"start":a[0],"end":a[1]}
        c.append(k)
e=sorted(c,key=lambda num:num["start"])
e=sorted(e,key=lambda num:num["end"])
ee=[e[0]]
for i in e[1:]:
    if i["start"]>=ee[-1]["end"]:
        ee.append(i)
l = 0
for i in e:
    if ee[-2]["end"]<=i["start"]:
        l=max(l,i["start"]-ee[-2]["end"])
print(len(ee),l)


