# with open("2622.txt")as f:
#     N = f.readline()
#     data=[]
#     for i,line in enumerate(f,start=1):
#         a = list(map(int,line.split()))
#         k = {"хранение":a[0],"годность":a[1],"минимальное":min(a),
#              "Тип":"хранение" if min(a)==a[0] else "годность","номер":i}
#         data.append(k)
# data1=sorted(data,key= lambda x:x["минимальное"])
# t=0
# for i in data1[:1]:
#     if i["Тип"]=="годность":
#         t+=1
# print(data1[-1]["номер"],t)
# Во время сессии студенты сдают 4 экзамена, за каждый из которых можно получить от 2 до 5 баллов.
# Студенты, получившие хотя бы одну «двойку», считаются не сдавшими сессию.
# Результаты сессии публикуются
# в виде рейтингового списка, в котором сначала указаны идентификационные номера студентов (ID),
# сдавших сессию,
# в порядке убывания среднего балла за сессию, а в случае равенства средних баллов
# – в порядке возрастания ID.
#
# Затем располагаются ID студентов, не сдавших сессию: сначала – получивших одну «двойку»,
# затем – две «двойки»,
# потом ID студентов с тремя «двойками» и, наконец, ID студентов, получивших по 2 балла
# за каждый из экзаменов.
# Если студенты имеют одинаковое количество «двоек», то их ID в рейтинге располагаются
# в порядке возрастания.
#
# Повышенную стипендию получают студенты, занявшие в рейтинговом списке первые 25 % мест,
# при условии отсутствия у них «двоек».
# Гарантируется, что без «двоек» сессию сдали не менее 25 % студентов.
#
# Найдите ID студента, который занимает последнее место среди студентов
# с повышенной стипендией, а также ID первого
# в рейтинговом списке студента, который имеет более двух «двоек».
#
# Входные данные
#
# В первой строке входного файла находится число N, обозначающее количество студентов
# (целое положительное число,
# не превышающее 10 000). Каждая из следующих N строк содержит 5 чисел через пробел:
# ID студента (целое положительное число,
# не превышающее 100 000) и четыре оценки, полученные им за сессию. Гарантируется,
# что общее число студентов N кратно 4 и
# хотя бы один студент имеет более двух «двоек». Во входном файле все ID различны.
# В ответе запишите два целых положительных числа: сначала ID студента,
# который занимает последнее место среди
with open("2604.txt")as f:
    N = f.readline()
    data=[]
    for line in f:
        s=list(map(int,line.split()))
        m = [s[1],s[2],s[3],s[4]]
        k={"ID":s[0],"s_1":s[1],"s_2":s[2],"s_3":s[3],"s_4":s[4],"m":sum(m)/len(m),"two":m.count(2)}
        data.append(k)
data1=sorted(data,key = lambda x:(-x["m"],x["two"],x["ID"]))
h = N//4
answ_1 = data[h-1]["ID"]
for i in data:
    if i["two"]>2:
        print(i["ID"])
        break
print(answ_1)
# s = {"Маша":5,"егор":4}
# k = sorted(s.items(),key=lambda x:(-x[1],x[0]))




