# Для хранения растрового изображения размером 192 на 960 пикселей отведено 90 Кбайт памяти
# без учёта заголовка файла.
# Для кодирования цвета каждого пикселя используется одинаковое количество бит,
# коды пикселей записываются в файл один за
# другим без промежутков. Какое максимальное количество цветов можно использовать в изображении?
#
# Формула для определения объема памяти, необходимого для хранения растрового изображения:
#
# V=h⋅w⋅i
#
# Здесь:
#
# h — высота изображения;
# w — ширина изображения;
# i — вес одного пикселя.
# Формула Хартли:
#
# i=log2N
#
# Здесь:
#
# N — количество цветов в палитре;
# i — вес одного пикселя.
from functools import lru_cache

h = 192
w = 960
v = 90 * 2**13
i = v//(h*w)
N = i**2
print(N)
# На предприятии каждой изготовленной детали присваивают серийный номер,
# содержащий десятичные цифры, 26 латинских букв (без учёта регистра) и
# символы из 34-символьного специального алфавита. В базе данных для хранения
# каждого серийного номера отведено одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийных номеров, все символы
# кодируются одинаковым и минимально возможным числом бит. Известно, что для
# хранения 1142 серийных номеров требуется более 305 Кбайт памяти.
# Определите минимально возможную длину серийного номера. В ответе запишите только целое число.
from math import log2,ceil
m = 70
n = 1142
p = 305 * 2**10
for i in range(1,1000):
    j = ceil(log2(m))
    jb= ceil(i * j/8)
    if jb*n > p:
        print(i)
        break
# Определите количество цифр с чётным числовым значением в
# 36-ричной записи числа, заданного выражением:
#

# a = 5*1296**2021-4*216**2022+3*36**2023-2*6**2024-2025
# n = 0
# while a:
#     if (a % 36 )%2==0:
#         n+=1
#     else:
#         a = a//36
# print(n)"
# Откройте файл 9-1.txt, содержащий в
# каждой строке четыре натуральных числа.
# Определите количество строк таблицы,
# содержащих числа, для которых выполнены оба условия:
#
# наибольшее из четырёх чисел меньше суммы трёх других;
#
# четыре числа нельзя разбить на две пары чисел с равными суммами.
# 1 3 6 8
# В ответе запишите только число.
c = 0
with open("9-1.txt")as f:
    d =[]
    for i in f:
        l = list(map(int,i.split()))
        d.append(l)
for i in d:
    k = 0
    i1 = sorted(i)
    if i1[3]<i1[0]+i1[1]+i1[2]:
        k+=1
    if i1[3]+i1[0]!=i1[2]+i1[1]:
        k+=1
    if k == 2:
        c +=1
print(c)
# В файле 17-2.txt содержится последовательность целых чисел.
# Её элементы могут принимать целые значения от -100 000 до 100 000
# включительно. Определите количество пар последовательности, в
# которых хотя бы один из элементов является четырёхзначным числом,
# а квадрат суммы элементов пары меньше квадрата максимального из
# четырёхзначных элементов последовательности, оканчивающихся на 43.
# В ответе запишите количество найденных пар чисел, затем максимальный
# из квадратов сумм элементов таких пар. В данной задаче под парой подразумевается
# два идущих подряд элемента последовательности.
with open("17-2.txt")as f:
    l = list(map(int,f))
c = []
for j in l:
    if 1000<=abs(j)<10000 and abs(j)% 100==43:
        c.append(j)
c1 = max(c)**2
n = []
for i in range(len(l)-1):
    a1 = l[i]
    a2 = l[i+1]
    if (1000<=abs(a1)<10000 or 1000<=abs(a2)<10000) and (a1+a2)**2<c1 :
        n.append((a1+a2)**2)
print(len(n),max(n))
from functools import lru_cache
@lru_cache(maxsize=None)
def f(n):
    if n ==1:
        return 1
    if n > 1:
        return n*f(n-1)
for i in range(1,2024):
    f(i)
print((f(2024)-2*f(2023))//f(2022))


















