# **Задание 1**
#
# **Файл 2605.txt**
#
# В супермаркете проводится акция «каждый девятый товар бесплатно».
# Покупатель, чтобы максимально использовать условие акции, разделил
# все товары на ленте на группы, по девять товаров в каждой.
#
# За каждую группу он собирался заплатить отдельным чеком. В каждой группе
# из девяти товаров самый дорогой он поместил на девятое место.
#
# Однако выяснилось, что программа для кассового аппарата не учитывает
# расположения товаров на ленте и сортирует цены товаров в чеке таким образом,
# чтобы стоимость покупки была максимально возможной.
#
# Тогда покупатель разместил товары по-другому.
#

# **Входные данные**
#
# В первой строке входного файла находится число N — количество товаров,
# которые планирует приобрести покупатель (натуральное число, не превышающее 10 000).
# В следующих N строках находятся цены товаров, которые выбрал покупатель
# (все числа натуральные, не превышающие 10 000, каждое — в отдельной строке).
#
# Цены товаров указаны в произвольном порядке.
# Запишите в ответе два целых числа: сначала минимальную цену,
# которую планировал заплатить покупатель изначально, если бы бесплатным был 9-й товар
# в любой покупке, состоящей из 9 предметов. Затем запишите цену,
# которую он заплатил. Покупатель делит товары на группы наиболее
# выгодным для себя способом.
with open("2605.txt")as f:
    n = int(f.readline())
    data = list(map(int,f))
data1 = sorted(data)
a = n/9
summ=0
for i,number in enumerate(data1,start=1):
    if i%9==0:
        summ+=number
s = sum(data1[:-a])
print(sum(data)-summ,s)

