# Таня записывает голосовое сообщение для своей подруги.
# Перед отправкой сообщение оцифровывается в формате стерео с частотой дискретизации 28 000 Гц
# и глубиной кодирования 8 бит. Определите наименьшее количество Кбайт,
# необходимое для сохранения сообщения в памяти (без учёта заголовка),
# если его длительность – 2 минуты 20 секунд.
#
# В ответе укажите целую часть полученного числа.
#
# Формула для вычисления объема звукового файла следующая:
#
# V=k⋅t⋅i⋅η
#
# Где:
#
# k — количество каналов (1, 2 или 4);
# t — длительность записи в секундах;
# i — глубина кодирования в битах (разрешение);
# η – частота дискретизации в герцах.
i = 8/2**13
v = 2*28000*140*i
print(v)
#7656
# №11 (28757)
#
# При регистрации в компьютерной системе каждому объекту присваивается идентификатор,
# состоящий из 289 символов и содержащий только десятичные цифры и символы из 1015-символьного
# специального алфавита. В базе данных для хранения каждого идентификатора отведено одинаковое
# и минимально возможное целое число байт.
# При этом используется посимвольное кодирование идентификаторов,
# все символы кодируются одинаковым и минимально возможным количеством бит.
# Определите объём памяти (в Мбайт), необходимый для хранения 524 288 идентификаторов.
# В ответе запишите только целое число – количество Мбайт.
from math import log2,ceil
n = 10 + 1015
l = 289
a = 524288
i = (ceil(log2(n))* l)/8
v = ceil((a*i)/2**20)
print(v)
#199
# №14 (28935)
#
# Операнды арифметического выражения записаны в системе счисления с основанием 23.
#
# 761x03523+338x93223
#
# В записи чисел переменной х обозначена неизвестная цифра из алфавита 23-ричной системы счисления.
# Определите наименьшее значение х, при котором значение данного арифметического выражения кратно 22.
# Для найденного х вычислите частное от деления значения арифметического выражения на 22 и
# укажите его в ответе в десятичной системе счисления. Основание системы счисления указывать не нужно.
from string import printable
for i in printable[:23]:
     a = int(f"761{i}035",23)+ int(f"338{i}932",23)
     if a%22==0:
         print(i,a//22)
#70045642
# №9 (27621)
#
# Откройте файл 9-2.txt,
# содержащий в каждой строке пять натуральных чисел.
# Определите наименьший номер строки таблицы, для которой выполнены оба условия:
#
# в строке все числа различны;
#
# разность максимального и минимального чисел строки равна сумме трёх её оставшихся чисел.
#
# В ответе запишите только число.
with open("9-2.txt")as f:
    c = []
    for i in f:
        l =list(map(int,i.split()))
        c.append(l)
    for n,i in enumerate(c,1):
        i1 = sorted(i)
        if len(set(i))==len(i) and (i1[4]-i1[0])==(i1[1]+i1[2]+i1[3]):
            print(n)
#7389
# В файле 17-0.txt содержится последовательность натуральных чисел.
# Её элементы могут принимать целые значения от 1 до 100 000 включительно.
# Определите количество пар элементов последовательности,
# в которых хотя бы одно число кратно минимальному элементу последовательности,
# кратному 23. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар.
# В данной задаче под парой подразумевается два идущих подряд элемента последовательности.
with open("17-0.txt")as f:
    l = list(map(int,f))
c = []
b = []
for j in l:
    if j%23==0:
        c.append(j)
c1 = min(c)
for i in range(len(l)-1):
    a = l[i]
    a1 = l[i+1]
    if a%c1 == 0 or a1%c1==0:
        b.append(a+a1)
print(len(b),max(b))
#113 168437
# №16 (28761)
#
# Алгоритм вычисления значения функции F(n), где n – целое число, задан следующими соотношениями:
#
# F(n)=3 при n<10
#
# F(n)=(n+4)×F(n−5) если n≥10
#
# Чему равно значение выражения (F(257487)/683+67×F(257477))/F(257472)
#
# В ответ запишите целую часть полученного числа
from functools import lru_cache
@lru_cache(maxsize=256)
def f(n):
    if n<10:
        return 3
    if n >=10:
        return (n+4)*f(n-5)
for i in range(10,257487):
    f(i)
print((f(257487)//683+67*f(257477))//f(257472))
#24994270044009
# №23 (28764)
#
# Исполнитель преобразует число на экране.
# У исполнителя есть три команды, которые обозначены латинскими буквами:
#
# A. Прибавить 1
# B. Прибавить 3
# C. Умножить на 2
# Программа для исполнителя – это последовательность команд.
# Сколько существует программ, для которых при исходном числе 2 результатом является число 25,
# и при этом траектория вычислений содержит число 15 и не содержит 7?
def f(x,y):
    if x==y:
        return 1
    elif x>y or x==7:
        return 0
    else:
        return f(x+1,y)+f(x+3,y)+f(x*2,y)
print(f(2,15)*f(15,25))
#2716



