# *
# / - деление
# -+
# ** - в степень
# // - целочисленое деление
# % - остаток от деления
# конкатанация
# a= "a" + "b"
# b= [1,2,2] + [1,2,3]
# # list * int
# b = [1,2] * 10
# #  set  и словарь нельзя умножить
# b = 10
# b %= 2
# b = b % 2
# b //= 3
# b = 123
# a = b % 10
# c = b//10
# c %=10
# n = b //100
# print(a,c,n)
# a = -7 % 2 положит число
# a = 7 %-2 отриц число
#  a = -7 % -2 отриц число
# a = 10,20 будет кортеж
# a, b = 10,20
# # c = a
# # a = b
# # b = c
# a,b=b,a
# #
# a = 10.3
# b = 10.6
# c = 10.5
# # значение количество цифр после запятой ( округление)
# print( round(a),round(b), round(c))
# a= 10.268
# print(round(a,2))
# 1
# a = 1
# b = 2
# c = 3
# a,b,c = 4,5,6
# print(a,b,c)
# 2
# x = 2
# print(x**5)
# 3
# a = 144
# a **= 0.5
# b = 144 ** 0.5
# print(a,b)
# 3
# x = 50
# y = 8
# x /= 3
# c = x % y
# print(x,c)
# 4
# num = 98765
# b = num // 10
# b %= 10
# print(b)
# a = num // 100
# a %= 10
# print(a)
# сколько нулей у делителя остатка , столько и цифр при условии что число больше делителя и нет нуля в конце
# 5
# a = float(input())
# b = float(input())
# s= 0.5 * a * b
# print(s)
# 6
# a = int(float((input())))
# b = a % 10
# c = a % 100
# c = c // 10
# d = a // 100
# print(b,c,d)






