# 1. Напишите функцию, которая суммирует элементы списка, начиная с начального значения start (по умолчанию 0).
#
def a(c,start = 0):
    return sum(c) + start
s = a([1,2,3,4,5])
print(s)
# 2. Напишите функцию, которая принимает натуральное число и возвращает его факториал (используя цикл!).
#
def a(d):
    f = 1
    for i in range(1,d + 1):
        f *= i

    return f
print(a(5))
# 3.Напишите функцию number_to_digits(n), которая принимает натуральное число и возвращает список его цифр.
#
def a(n):
    st= str(n)
    s = []
    for i in st:
        s.append(i)
    return s
print(a(545))
# 4.Напишите функцию count_occurrences(s, char), которая принимает строку и символ и возвращает количество вхождений символа
# в строку.
def a(s,char):
    c = 0
    for i in s:
        if i == char:
            c += 1
    return c
print(a("1@45@","@"))
# Напишите функцию analyze_text(text), которая принимает строку и возвращает кортеж из: количества символов,
# количества слов, количества предложений. Предложения заканчиваются точками,
# вопросительными или восклицательными знаками. Слова разделяются пробелами.
def a(text):
    c = 0
    w = 0
    s = 0
    for i in text:
        c +=1
    for i in text:
        if i ==" ":
           w += 1
        if i == "." or i == "!" or i == "?":
            s +=1
    return (c,w,s)
print(a("djvnde"))