# Напишите программу, которая выводит на экран количество символов
# в ведённой пользователем строке на экран
# a = input()
# print(len(a))
# Пользователь вводит строку. Определите, есть ли в ней буква а
# a = input()
# if "a" in a:
#     print("есть")
# else:
#     print("нет")
# Пользователь вводит строку.
# Выведите индекс первого вхождения буквы о.
# Если буквы о нет, выведите сообщение об этом.
# a = input()
# if "о" in a:
#     print(a.index("о"))
# if "o" not in a:
#     print("буквы о нет")
# Преобразуйте строку к верхнему и нижнему регистру.
# a = input()
# print(a.upper())
# print(a.lower())
# Пользователь вводит строку. Определите, оканчивается ли строка на "ов".
# a = input()
# print(a.endswith("ов"))
# Найдите индекс последнего вхождения буквы "а" в строке, введённой пользователем
# a = input()
# print(a.rfind("a"))
# ользователь вводит строку. Определите, состоит ли она только из букв.
# a = input()
# print(a.isalpha())
# Разбейте строку по пробелам и соедините обратно через запятую.
a = input()
b = (a.split(" "))
s = ",".join(b)
print(s)


