# 1408) Операнды арифметического выражения записаны в системе счисления с основанием 25.
# 11353x1225 + 135x2125
#
# В записи чисел переменной x обозначена неизвестная цифра из алфавита 25-ричной системы счисления.
# Определите наибольшее значение x, при котором значение данного арифметического выражения кратно 24.
# Для найденного x вычислите частное от деления значения арифметического выражения на 24 и укажите его в ответе
# в десятичной системе счисления. Основание системы счисления указывать не нужно.
# import string
# for i in string.printable[:25]:
#     a = int(f"11353{i}1225",25)
#     b = int(f"135{i}2125",25)
#     if (a+b) % 24==0:
#         r = (a+b)/24
#         print(int(r))
#166405926515
#
# 2.
#
# (1424) Операнды арифметического выражения записаны в системе счисления с основанием 29.
# 923x787429 + 524x615229
#
# В записи чисел переменной х обозначена неизвестная цифра из алфавита 29-ричной системы счисления.
# Определите наибольшее значение х, при котором значение данного арифметического выражения кратно 28.
# Для найденного х вычислите частное от деления значения арифметического выражения на 28 и укажите
# его в ответе в десятичной системе счисления. Основание системы счисления указывать не нужно.
#
import string
for i in string.printable[:29]:
    a =int(f"923{i}787429",29)
    b = int(f"524{i}615229",29)
    if (a+b)%28==0:
        r =(a+b)/28
        print(int(r))
# 3.
#
# Откройте файл 911.txt, содержащий в каждой строке шесть натуральных чисел.
# Определите наибольший номер строки таблицы, для чисел которой выполнены оба условия:
#
# в строке есть одно число, которое повторяется трижды, остальные три числа различны;
# повторяющееся число строки больше, чем среднее арифметическое её неповторяющихся чисел.
#
# with open("911.txt")as f:
#     d = []
# c = 0
# for line in f:
#     a = list(map(int, (line.split())))
#     d.append(a)
# for i in d:
#     b = []
#     for j in i:
#         b.append(i.count(j))
#     b1 =sorted(b)
#     if b1 == [1,1,1,3,3,3]:
#         c+=1
# for a in d:
#     if a.count(d)==3:
#         d.pop(a)

# 4.
#
# Откройте файл 913.txt, содержащий в каждой строке пять натуральных чисел.
# Определите наибольший номер строки таблицы, для которой выполнены оба условия:
#
# в строке все числа различны;
# удвоенная сумма минимального и максимального чисел строки равна утроенной сумме трёх её оставшихся чисел.
with open("913.txt")as f:
    d = []
    for line in f:
        a = list(map(int,line.split()))
        d.append(a)
c = 0
for i in d:
    print(i)
#     for j in i:
#         if len(i) ==len(set(j)):
#             c+=1
#         j1 = j.copy()
#         j.pop(max(j))
#         j.pop(min(j))
#         if (max(j1)+min(j1))*2==(j[0]+j[1]+j[2])*3:
#             c+=1
# for i,line in enumerate(d,start=1):

with open("930.txt")as f:
    d = []
    for line in f:
        a = list(map(int,line.split()))
        d.append(a)
def r1(line):
    a = []
    for i in line:
        a.append(line.count(i))
        a1=sorted(a)
        return a1 == [1,1,2,2,2,2]
def r2(line):
    c = []
    for i in line:
        if line.count(i)==2:
            c.append(i)
            c1= set(c)
            line.remove(i)
        return sum(line)<=sum(c1)
    for i,line in enumerate(d,start=1):
        if r1(line) and r2(line):
            print(i)


