# Пользователь вводит координаты точек на плоскости.
# Рассчитайте периметр многоугольника, образованного этими точками.
import math
n = int(input("Введите количество точек"))
list = []
for i in range(n):
    x = int(input("x:"))
    y = int(input("y:"))
    list += [(x,y)]
sum = 0
for i in range(n):
    x1,y1 = list[i]
    x2,y2 = list[(i+1)%n]
    sum = math.sqrt((x1-x2)**2 + (y1-y2)**2)
print(sum)

# Напишите программу, которая использует вложенные циклы for с range() для вывода пирамиды из чисел высотой H,
# # где каждая строка содержит числа от 1 до номера строки и обратно.
# # H вводится пользователем.Входные данные:
# H = int(input())
# for i in range(1,H + 1):
#     for j in range(1,i + 1):
#         for u in range(u, 0, - 1):
#             print(u,end= "")
#         print()
# Напишите программу, которая использует цикл while для симуляции роста вклада с годовой ставкой R% в течение Y лет.
# Годовая ставка в R% означает, что вся сумма вклада под конец года увеличивается на R%.
# Начальная сумма S вводится пользователем.
# Выведите сумму на конец каждого года, число округляйте до 3 знака после запятой.
# Пользователь вводит последовательно: начальную сумму, ставку и длительность вклада в годах
# s = int(input())
# c = int(input())
# d = int(input())
# a = 1
# while a <= d:
#     s = s + (s/c)
#     a = a + 1
#     print(round(s,3))
# Напишите программу вычисления факториала натурального числа, введённого с клавиатуры.
# Факториалом числа N называют произведение всех натуральных чисел до N включительно
# n = int(input())
# a = 1
# for i in range(1,n + 1):
#     a = a * i
# print(a)
# Напишите цикл, который переводит число из десятичной системы счисления в двоичную
# Обычно десятичное число преобразуют к двоичному представлению путем нахождения остатков от деления на 2.
#
# При этом полученное на предыдущем шаге частное выступает в качестве делимого на следующем шаге.
#
# Деление заканчивается, когда делимое обращается в ноль.
#
# Остатки собираются в двоичное число начиная с конца, то есть последний остаток будет первой цифрой двоичного числа.
# a = int(input())
# m = ""
# if a == 1:
#     print(1)
# if a == 0:
#     print(0)
# while a >= 2:
#     c = a % 2
#     d = a // 2
#     a = d
#     c = str(c)
#     m = m + c
#     if d < 2:
#         print(d,m[::- 1],sep = "")
