# **Файл 2622.txt**
#
# Отдел маркетинга сети магазинов составляет рейтинг продуктов по информации об их сроках хранения с момента изготовления
# и после вскрытия упаковки. Для каждого продукта известен срок его хранения с момента изготовления
# и срок годности к употреблению после вскрытия упаковки. Продукты пронумерованы начиная с единицы.
# В рейтинговом списке маркетологи располагают продукты по следующему алгоритму:
# – все 2N чисел, обозначающих срок хранения и срок годности к употреблению для N продуктов, упорядочивают по возрастанию;
# – если минимальное число в этом упорядоченном списке – срок хранения, то продукт в рейтинге занимает первое свободное место от
# его начала;
# – если минимальное число – срок годности к употреблению, то продукт занимает первое свободное место от конца рейтинга;
# – если число обозначает срок хранения или срок годности к употреблению уже рассмотренного продукта,
# то его не принимают во внимание.
# Этот алгоритм применяется последовательно для размещения всех N продуктов.
# Определите номер последнего продукта, для которого будет определено его место в рейтинге, и количество продуктов,
# которые займут в рейтинге более низкие места.
# **Входные данные**
# В первой строке входного файла находится натуральное число N (N ≤ 1000) – количество продуктов.
# Следующие N строк содержат пары
# чисел, обозначающих соответственно
# срок хранения продукта с момента изготовления и срок годности к употреблению
# после вскрытия упаковки (все числа натуральные, различные).
#
#
# Запишите в ответе два натуральных числа: сначала номер последнего продукта, для которого будет
# определено его место в рейтинге, затем – количество продуктов, которые займут в рейтинге более низкие места.
# with open("2622.txt")as f:
#     n=int(f.readline())
#     c =[]
#     for i in f:
#         a = list(map(int,i.split()))
#         k = {"cрок хранения":a[0],"срок годности после вскрытия":a[1]}
#         c.append(k)
#e = sorted(c,key=lambda n1:n1[])
#print(e)
with open("2610.txt") as f:
    n =int(f.readline())
    c = []
    for i in f:
        a = list(map(int,i.split()))
        k={"long":a[0],"start":a[1]}
        c.append(k)
e=sorted(c,key=lambda num:num["start"])
e=sorted(e,key=lambda num:num["long"])
ee=[e[0]]
for i in e[1:]:
    if i["long"]+i["start"]>=ee[-1]["start"]+ee[-1]["long"]:
        ee.append(i)
l = 0
for i in e:
    if ee[-2]["start"]+ee[-2]["long"]<=i["start"]:
        l=max(l,i["start"]-(ee[-2]["start"]+ee[-2]["long"]))
print(len(ee),l)


