# Голосовое сообщение продолжительностью 3 минуты 10 секунд было записано в формате стерео
# и оцифровано с глубиной кодирования 16 бит и частотой дискретизации 12 000 измерений в секунду.
# Сжатие данных не использовалось. Определите объём голосового сообщения в Кбайт.
# В ответе укажите только целую часть полученного числа.
#
# Формула для вычисления объема звукового файла следующая:
#
# V=k⋅t⋅i⋅η
#
# Где:
#
# k — количество каналов (1, 2 или 4);
# t — длительность записи в секундах;
# i — глубина кодирования в битах (разрешение);
# η – частота дискретизации в герцах.
i = 16/2**13
v = 2*190*i*12000
print(v)
# ответ 8906
# При регистрации в компьютерной системе каждому объекту присваивается идентификатор, состоящий из 257 символов
# и содержащий только цифры семнадцатеричной системы счисления и символы из 4080-символьного специального алфавита.
# В базе данных для хранения каждого идентификатора отведено одинаковое и минимально возможное целое число байт.
# При этом используется посимвольное кодирование идентификаторов, все символы кодируются одинаковым и минимально
# возможным количеством бит. Определите объём памяти (в Мбайт),
# необходимый для хранения 8 388 608 идентификаторов. В ответе запишите только целое число – количество Мбайт.
from math import log2,ceil
n= 17+4080
l = 257
i = ceil(log2(n))# в битах
i1 = ceil((i * l)/8)
a =8388608
v = (a*i1)/2**20
print(v)
# 1090519144
# №14 (27769)
# Операнды арифметического выражения записаны в системе счисления с основанием 22.
#
# 12313x5722+1x3456122
#
# В записи чисел переменной х обозначена неизвестная цифра из алфавита 22-ричной системы счисления.
# Определите наибольшее значение х, при котором значение данного арифметического выражения кратно 21.
# Для найденного х вычислите частное от деления значения арифметического выражения на 21
# и укажите его в ответе в десятичной системе счисления. Основание системы счисления указывать не нужно.
from string import printable
for i in printable[:22]:
    a = int(f"12313{i}57",22) + int(f"1{i}34561",22)
    if a %21==0:
        print(i,a//21)
# print((f"12313{c1}57" + f"1{c1}34561")//21)
# Откройте файл 9-0.txt, содержащий в каждой строке пять целых чисел.
# Определите количество строк таблицы, для которых выполнены оба условия:
#
# в строке все числа расположены в порядке возрастания;
#
# сумма минимального и максимального чисел строки не больше суммы оставшихся трёх её чисел.
#
# В ответе запишите только число.
# with open("9-0.txt")as f:
# c = []
# b = 0
# for i in f:
#     l=list(map(int,i.split()))
#     c.append(l)
# for j in c:
#     k = 0
#     j1= sorted(j)
#     if j1[0]+j[4]<=j1[1]+j1[2]+j1[3]:
#         k+=1
#
#     for i in range(len(j)-1):
#         cc=0
#         if j[i]<j[i+1]:
#             cc+=1
#         if cc == len(j)-1:
#             k+=1
#     if k==2:
#         b+=1
# print(b)
# # №17 (29349)
#
# В файле 17-1.txt содержится последовательность целых чисел.
# Её элементы могут принимать целые значения от –100 000 до 100 000 включительно.
# Определите количество пар последовательности,
# в которых сумма элементов меньше минимального положительного элемента последовательности, кратного 123. Гарантируется,
# что такой элемент в последовательности есть.
# В ответе запишите количество найденных пар, затем абсолютное значение максимальной из сумм элементов таких пар.
# В данной задаче под парой подразумевается два идущих подряд элемента последовательности.
# with open("17-1.txt")as f:
#     l= list(map(int,f))
#     c = []
#     for j in l:
#         if abs(j)%123==0:
#             c.append(j)
#     c1 = min(c)
#     n = []
#     for i in range(len(l)-1):
#         a = l[i]
#         a1=l[i+1]
#         if a+a1<c1:
#             n.append(a+a1)
# print(len(n),max(n))
# №16 (29348)
#
# Алгоритм вычисления значения функции F(n), где n – целое число, задан следующими соотношениями:
#
# F(n)=1 при n<10
#
# F(n)=(n+3)×F(n−3) если n≥10
#
# Чему равно значение выражения (F(247563)/519−477×F(247560))/F(247557)
#
# В ответ запишите целую часть полученного числа
from functools import lru_cache
@lru_cache(maxsize=256)
def f(n):
    if n<10:
        return 1
    if n >=10:
        return (n+3)*f(n-3)
for i in range(10,247563):
    f(i)
print((f(247563)//519-477*f(247560))//f(247557))

# №23 (29353)
#
# Исполнитель преобразует число на экране.
#
# У исполнителя есть три команды, которые обозначены латинскими буквами:
#
# A. Прибавить 1
# B. Умножить на 2
# C. Умножить на 3
# Программа для исполнителя – это последовательность команд.
#
# Сколько существует программ, для которых при исходном числе 2 результатом является 39
# и при этом траектория вычислений не содержит числа 14?
#
# Траектория вычислений программы – это последовательность результатов выполнения всех команд программы.
#
# Например, для программы ABC при исходном числе 7 траектория состоит из чисел 8, 16, 48.
def f(x,y):
    if x == y:
        return 1
    elif x>y or x == 14:
        return 0
    else:
       return f(x+1,y)+f(x*2,y)+f(x*3,y)
print(f(2,39))
#188








