#  В файле 1712.txt содержится последовательность целых чисел.
#  Её элементы могут принимать целые значения от –10 000 до 10 000 включительно.
# Определите и выведите на экран сначала количество пар элементов последовательности,
# в которых оба числа оканчиваются на нечётные цифры, различные для элементов в паре,
# затем минимальное из произведений модулей элементов таких пар.

# В данной задаче под парой подразумевается два идущих подряд элемента последовательности.
with open("1712.txt",mode= "r",encoding="utf-8")as f:
    l = list(map(int,f))
e = []
for i in range(len(l)-1):
    a1 = l[i]
    a2 = l[i+1]
    d = a1%10
    d1 = a2%10
    if (a1 % 2 !=0 and a2 % 2 != 0) and (d != d1):
       e.append(abs(a1*a2))
print(len(e),min(e))
# В файле 1700.txt содержится последовательность натуральных чисел.
# Её элементы могут принимать целые значения от 1 до 100 000 включительно.
#
# Определите количество пар последовательности, в которых остаток от деления хотя бы одного из элементов на 16 равен минимальному элементу последовательности.
#
# Выведите на экран количество найденных пар, затем максимальную из сумм элементов таких пар.
#
# В данной задаче под парой подразумевается два идущих подряд элемента последовательности.
with open("1700.txt",mode="r",encoding="utf-8") as f:
    l = list(map(int,f))
minn = min(l)
e = []
for i in range(len(l)-1):
    a1 = l[i]
    a2 = l[i+1]
    if a1%16 == minn or a2%16==minn:
        e.append(a1+a2)
print(len(e),max(e))



