# Реализуйте следующий алгоритм на языке Python:
# Пользователь вводит число.
# Если оно делится и на 3, и на 5 — вывести "FizzBuzz".
# Если только на 3 — вывести "Fizz".
# Если только на 5 — вывести "Buzz".
# Иначе вывести само число.
# a = int(input())
# if a % 3 == 0 and a%5==0:
#     print("FizzBuzz")
# elif a % 3 == 0:
#     print("Fizz")
# elif a % 5 == 0:
#     print("Buzz")
# else:
#     print(a)
# У пользователя запрашивается ввод одного из двух чисел: 1 или 2.
# Если пользовател ввёл 1, то запрашивается одного числа — радиус круга.
# Программа выводит площадь круга по введенному радиусу.
# Если пользователь ввёл 2, то запрашивается ввод двух чисел — длина большой и малой полуоси эллипса.
# Программа выводит площадь эллипса по введенным данным.
# Если введено число не из заданного диапазона, выводится сообщение об ошибке
print("введите 1 или 2")
from math import *
a = int(input())
if a == 1:
     r=int(input())
     print(pi*r**2)
elif a == 2:
     d1 = int(input())
     d2 = int(input())
     print(pi*d1*d2)
else:
     print("ошибка")
# Напишите программу, которая будет запрашивать у пользователя длины всех трех сторон треугольника
# и выдавать сообщение о том, к какому типу следует его
# относить (равносторонний, равнобедренный, разносторонний)
# a = int(input())
 b = int(input())
# c = int(input())
# if a==b==c:
#     print("равносторонний")
# elif a == b and a!= c:
#     print("равнобедренный")
# elif a == c and a!=b:
#     print("равнобедренный")
# elif c == b and c != a:
#     print("равнобедреный")
# else:
#     print("разносторонний")
