# В файле 1710.txt содержится последовательность натуральных чисел.
# Её элементы могут принимать целые значения от 1 до 100 000 включительно.
# Определите количество пар последовательности, в которых сумма чисел пары равна максимальному элементу последовательности.
# Выведите на экран количество найденных пар, затем максимальную из сумм квадратов элементов таких пар.
# В данной задаче под парой подразумевается два идущих подряд элемента последовательности.
with open("1710.txt",mode = "r",encoding="utf-8") as f:
    l = list(map(int,f))
c = 0
s = []
maxx = max(l)
for i in range(len(l)-1):
    a = l[i]
    a1 = l[i+1]
    if a+a1 == maxx:
        c+=1
        s.append(a**2 + a1**2)
print(c,max(s))
# В файле 1721.txt содержится последовательность натуральных чисел.
# Её элементы могут принимать целые значения от 1 до 100 000 включительно.
# Определите количество пар последовательности, в которых сумма остатков от деления обоих элементов на 44
# равна минимальному элементу последовательности. В ответе запишите количество найденных пар, затем минимальный модуль
# разности элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента
with open("1721.txt",mode="r",encoding="utf-8") as f:
    l = list(map(int,f))
minn = min(l)
c = 0
e = []
for i in range(len(l)-1):
    a = l[i]
    a1 = l[i+1]
    if ((a%44) + (a1%44)) == minn:
        c+=1
        s = abs(a-a1)
        e.append(s)
print(c,min(e))
# В файле 1724.txt содержится последовательность натуральных чисел.
# Её элементы могут принимать целые значения от 1 до 100 000 включительно.
# Определите количество троек последовательности, в которых только одно число оканчивается на 0,
# а сумма элементов тройки меньше максимального элемента последовательности.
# В ответе запишите количество найденных троек,
# затем минимальную из сумм элементов таких троек.
# В данной задаче под тройкой подразумевается три идущих подряд элемента
with open("1724.txt",mode="r",encoding="utf-8") as f:
    l = list(map(int,f))
maxx = max(l)
summ = []
for i in range(len(l)-2):
    count = 0
    a1 = l[i]
    a2 = l[i+1]
    a3 = l[i+2]
    if a1%10==0:
        count+=1
    if a2%10==0:
        count+=1
    if a3%10==0:
        count+=1
    if count == 1 and((a1 + a2 + a3)  < maxx ) :
        summ.append(a1 + a2 + a3)
print(len(summ),min(summ))



