# *Файл 2619.txt**
#
# На производстве штучных изделий N деталей должны быть отшлифованы и окрашены.
# \Для каждой детали известно время
# её шлифовки и время окрашивания. Детали пронумерованы начиная с единицы.
# Параллельная обработка деталей не предусмотрена. На ленте транспортёра имеется N мест для каждой из N деталей.
#
# На ленте транспортёра детали располагают по следующему алгоритму:
#
# * все 2N чисел, обозначающих время окрашивания и шлифовки для N деталей, упорядочивают по возрастанию;
# * если минимальное число в этом упорядоченном списке — это время шлифовки конкретной детали, то деталь размещают
# на ленте транспортёра на первое свободное место от её начала;
# *  если минимальное число — это время окрашивания, то деталь размещают на первое свободное место от конца ленты транспортёра
# *  если число обозначает время окрашивания или шлифовки уже рассмотренной детали, то его не принимают во внимание.
#
# Этот алгоритм применяется последовательно для размещения всех N деталей.
#
# Определите номер последней детали, для которой будет определено её место на ленте транспортёра, и количество деталей, которые
# будут отшлифованы до неё.
#
#
# **Входные данные**
#
# В первой строке [входного файла]находится натуральное число N (N < 1000)-
# количество деталей. Следующие N строк содержат пары чисел,
# обозначающих соответственно время шлифовки и время окрашивания конкретной детали (все числа натуральные, различные).
# Запишите в ответе два натуральных числа: сначала номер последней детали,
# для которой будет определено её место на ленте транспортёра, затем количество деталей, которые будут отшлифованы до неё.
with open("2619.txt")as f:
    a = f.readline()
    c = []
    for number,i in enumerate(f,start=1):
        k = list(map(int,i.split()))
        a={"время шлифовки":k[0],"время окрашивания":k[1],"номер":number,
           "минимальное":min(k),"тип":"время шлифовки" if min(k)==k[0] else "время окрашивания"}
        c.append(a)
c1 = sorted(c,key=lambda x:x["минимальное"])
counter = 0
for i in c1[-1]:
    if i["тип"]=="время шлифовки":
        counter+=1
print(c1[-1]["номер"],counter)

#
# **Задание 2**
#
# **Файл 2620.txt**
#
# Входной файл содержит информацию о заявках граждан,
# обращающихся во многофункциональный центр (МФЦ) в течение календарных суток.
# В заявке указаны время начала и время окончания приёма специалистом (в минутах от начала суток).
# Рабочие места специалистов МФЦ (окна) пронумерованы натуральными числами начиная с 1.
#
# Приём одного гражданина ведёт свободный специалист в окне с минимальным номером.
# Новый посетитель может обратиться к освободившемуся специалисту начиная со следующей минуты после завершения приёма предыдущего.
#
# Если в момент обращения в МФЦ свободных специалистов нет, то гражданин уходит.
# Определите, сколько граждан смогут попасть на приём в МФЦ в течение 24 ч,
# и каков номер окна специалиста, который начнёт принимать посетителя последним.
# Если таких окон несколько, укажите наименьший номер окна.
#
# ---
#
# **Входные данные**
# В первой строке входного файла находится натуральное число К, не превышающее 1000,
# — количество окон в МФЦ. Во второй строке
# натуральное число N (N ≤ 10 000), обозначающее количество граждан.
# Каждая из следующих N строк содержит два натуральных числа, каждое из которых не превышает 1440:
# указанные в заявке время начала и время окончания приёма (в минутах от начала суток).
# Запишите в ответе два числа: количество граждан,
# которые смогут воспользоваться услугами МФЦ, и номер окна,
# в котором специалист примет последнего гражданина.
# Типовой пример организации данных во входном файле:
#
# 2
#
# 5
#
# 30 60
#
# 40 100
#
# 59 60
#
# 61 100
#
# 101 144
#
# При таких исходных данных воспользоваться услугами МФЦ смогут первый,
# второй, четвёртый и пятый граждане. Наименьший номер окна, где последний
# из граждан будет принят специалистом, — 1, так как будут свободны окна 1 и 2.
with open("2620.txt")as f:
    a = int(f.readline())
    a1 = int(f.readline())
    c = []
    for i in f:
        k = list(map(int, i.split()))
        b = {"время начала":k[0],"время окончания":k[1]}
        c.append(b)
c1 = sorted(c,key=lambda x:x["время начала"])
ending_work = [0]*(a+1)
clients = 0
last_plase = 0
for data in c1:
    for window in range(1,a+1):
        if ending_work[window]< data["время начала"]:
            ending_work[window]=data["время окончания"]
            clients+=1
            last_plase= window
            print(data,window)
            break
print(clients,last_plase)

