# Реализуйте решение следующего алгоритма на языке Python:
# Пользователем вводится 2 числа.
# Первое число умножается на 6 и полученное произведение делится целочисленно на 4.
# Ко второму числу прибавляется остаток от его деления на 5.
# Оба числа выводятся на экран.
# a = int(input())
# b = int(input())
# c = a * 6
# c = c // 4
# d = b%5
# b = b + d
# print(c,b)
# Напишите программу для вычисления площади поверхности цилиндра по введеным с клавиатуры высоте цилиндра и его радиусу.
# Формула площади боковой поверхности: Sбок=2πrh
# Формула площади основания цилиндра: Sосн=πr2
# Формула площади полной поверхности: Sполн=Sбок+2∗Sосн
# import math
# h = int(input())
# r = int(input())
# s = math.pi * 2 * r * h
# s1 = math.pi * r * 2
# sp = s  + s1
# print(sp)
# Пользователем вводятся 2 трехзначных числа.
# Оба числа раскладываются на разряды.
# Соответствующие разряды каждого числа перемножаются.
# Выводятся три числа: произведение сотен, произведение десятков, произведение единиц
a = int(input())
b = int(input())
s = a // 100
s1 = b // 100
print( s * s1 )
d = a // 10
d = d % 10
d1 = b // 10
d1 = d1 % 10
print(d * d1)
e = a % 10
e1 = b % 10
print(e * e1)