
# books = [("Война и мир", 1865), ("1984", 1949), ("Гарри Поттер", 1997), ("Война и мир", 1865)]
# c = []
# c1 = []
# c2 = []
# c3 =[]
# for x,y in books:
#     if y > 1900:
#         c.append(x)
#     c1.append(y-100)
#     c3.append(x)
#     c3.append(y)
#     if y < 1950:
#         a = "классика"
#         c3.insert(0,a)
# print(c,c1,c3)
# Даны два кортежа a и b одинаковой длины.
# Сформируйте новый кортеж попарных сумм (a0+b0, a1+b1, ...) через цикл
a = [1,2,3]
b = [4,5,6]
c = []
for i in range(len(a)):
    f = a[i]+b[i]
    c.append(f)
print(c)