# У вас есть множество numbers = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}. Напишите программу, которая:
# Удаляет все четные числа из множества, используя метод discard() в цикле.
# Добавляет квадраты всех оставшихся чисел.
# Выводит итоговое множество.
# numbers = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}
# for i in list(numbers):
#     if i % 2 == 0:
#         numbers.discard(i)
#     else:
#         numbers.add(i**2)
# print(numbers)
# Создайте программу для работы с множеством:
# Начните с пустого множества my_set.
# В цикле 5 раз запрашивайте у пользователя число.
# Добавляйте каждое число в множество с помощью add().
# После окончания ввода выведите итоговое множество и количество его элементов.
# Найдите минимальное и максимальное значения в множестве.
# s = set()
# a = 0
# while a <5:
#     s.add(int(input()))
#     a +=1
# minn = min(s)
# maxx = max(s)
# c = len(s)
# print(s,c,maxx,minn)

# english_students = {"Михаил", "Наташа", "Олег", "Полина"}
# spanish_students = {"Наташа", "Олег", "Роман", "Света"}
# french_students = {"Олег", "Полина", "Роман", "Татьяна"}
# # Создайте множество всех студентов и добавьте нового студента "Антон"
# # в группу английского языка.Найдите студентов, которые изучают только один язык,
# # с помощью итерации по множествам.Удалите студента "Олег" из всех групп.
# a = english_students | spanish_students | french_students
# english_students.add("Антон")
# english_students.remove("Олег")
# spanish_students.remove("Олег")
# french_students.remove("Олег")
# print(a,english_students)

# 4.
# В центре творчества есть три множества участников, посещающих разные кружки:undefined
art_club = {"Елена", "Кирилл", "Маша", "Сергей"}
music_club = {"Кирилл", "Маша", "Надя", "Тимур"}
dance_club = {"Маша", "Сергей", "Надя", "Валерия"}
# роверьте, являются ли участники музыкального кружка подмножеством объединения художественного и танцевального кружков.
# Найдите участников, которые посещают хотя бы один кружок, и проверьте, является ли это множество надмножеством
# художественного кружка.Найдите участников, которые посещают только танцевальный кружок.П
a = art_club | dance_club
print(music_club.issubset(a))
b = art_club | music_club | dance_club
print(b.issuperset(art_club))
