# Дан следующий ряд вещественных чисел, в котором каждый последующий элемент делится на -2:
# undefined
# 1, -0.5, 0.25, -0.125, 0.0625 ...
#
#
# Напишите программу, которая принимает от пользователя число N (N<100) и выводит первые N элементов данного ряда.
# n = int(input())
# a = 1
# c = 0
# while c!=n:
#     print(a)
#     a = a / -2
#     c = c + 1
# Пользователь вводит число n. Выведите все его делители.
# n = int(input())
# a = 1
# while a <= n:
#     if n % a == 0:
#         print(a)
#         a = a + 1
#     if n % a != 0:
#         a = a + 1
# Выведите числа от 1 до 20. Если число делится на 3, оно не должно выводиться.
# В конце напечатайте строку "Готово"
# a = 1
# while a <= 20:
#     if a % 3 != 0:
#         print(a)
#         a = a + 1
#     if a % 3 == 0:
#         a = a + 1
# print("Готово")
# Переберите символы строки "python". Пропустите букву "t".
# В конце выведите "Перебор завершён".
a = "python"
i = 0
while i <= len(a) - 1:
    if a[i] == "t":
        continue
    print(a[i])
    i = i + 1

# Пользователь вводит число. Определите, является ли оно простым
# Если да, выведите "Простое", иначе — "Составное"
n = int(input())
a = 1
b = 0
c = 1 + n
while a <= n:
     if n % a == 0:
         b = b + a
         a = a + 1
     if n % a != 0:
         a = a + 1
if b == c:
    print("Простое")
elif b != c:
    print("Составное")






