# Татьяна фотографирует интересные места и события цифровой камерой своего смартфона.
# Каждая фотография представляет собой растровое изображение размером 1024×768 пикселей,
# при этом используется палитра из 230 цветов.В
# конце дня она отправляет снимки друзьям с помощью мессенджера.
# Для экономии трафика приложение оцифровывает снимки повторно, используя размер 800×600 пикселей и глубину цвета 28 бит.
# Сколько Кбайт трафика экономится при передаче 100 фотографий?В ответе укажите целую часть полученного числа.
#
# Формула для определения объема памяти, необходимого для хранения растрового изображения:
#
# V=h⋅w⋅i
# Здесь:h —высота изображения,
# w —ширина изображения,
# i —вес одного пикселя.
#
# Формула Хартли:
# i=log2N
# Здесь:
# N — количество цветов в палитре
#
# Для работы с передачей данных есть следующая формула:
# V=q⋅t
# Здесь
# V — объем файла в битах,
# q — скорость передачи данных (бит в секунду),
# t — время в секундах.
from math import *
i =log2(230)
V1 = i * 1024 * 768
V2 = 48 * 800 * 600
C = V1-V2
C = C * 100
C = C // (1024 * 8)
print(C)
# При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 7 символов
# и содержащий только символы 26-символьного набора строчных латинских букв и десяти арабских цифр.
# В базе данных для хранения сведений о каждом пользователе отведено одинаковое и минимально возможное
# целое число байт. При этом используют посимвольное кодирование паролей, все символы кодируют одинаковым
# и минимально возможным количеством бит. Кроме собственно пароля, для каждого пользователя в системе хранятся
# дополнительные сведения, для чего отведено 9 байт на одного пользователя.
# Определите объём памяти (в байтах), необходимый для хранения сведений о 30 пользователях.
# В ответе запишите только целое число – количество байт
#
# Объем всего сообщения (памяти) (I) вычисляется по формуле:
# I=L⋅i
# Здесь:L— длина сообщения (количество символов)
# i— вес одного символа сообщения
#
# Для нахождения веса одного символа (i) можно воспользоваться такой формулой:
# i=log2N
# Здесь:
# N — мощность алфавита, то есть количество уникальных символов (например, 10 цифр, 26 букв латинского алфавита и т.д.)
i = log2(36)
I = 7 * i
I = I * 30 + 30 * 9
print(I)