# Откройте файл 902, содержащий в каждой строке четыре натуральных числа. Определите количество строк, содержащих числа,
# для которых выполнены оба условия:
# наибольшее из четырёх чисел меньше суммы трёх других;
# среди четырёх чисел есть только одна пара равных чисел.
with open("902.txt",mode="r",encoding="utf-8") as f:
    d =[]
    for i in f:
        l = list(map(int,i.split()))
        d.append(l)
def f(l):
    m1 = max(l)
    s = sum(l) - m1
    return m1<s
c = 0
if len(d) - len(set(d))==1 and f(l):
    c+=1
print(c)
# Откройте файл 905, содержащий в каждой строке шесть натуральных чисел. Определите количество строк, содержащих числа,
# для которых выполнены оба условия:
# в строке только одно число повторяется трижды, остальные числа различны;
# квадрат суммы всех повторяющихся чисел строки больше квадрата суммы всех её неповторяющихся чисел.
with open("905.txt",mode="r",encoding="utf-8") as f:
    d = []
    for i in f:
        l = list(map(int, i.split()))
        d.append(l)
a = set(d)
c = list(a)
h = d - c
count = 0
if len(d)-len(a)==3 and sum(a)**2> sum(h)**2:
    c +=1
print(c)


# Откройте файл 907, содержащий в каждой строке семь натуральных чисел. Определите количество строк, содержащих числа, для которых выполняются оба условия:
# в строке есть два числа, каждое из которых повторяется трижды, одно число без повторений;
# наибольшее из повторяющихся чисел больше неповторяющегося числа.
