# Прибор автоматической фиксации нарушений правил дорожного движения делает цветные фотографии размером 1024×960 пикселей,
# используя палитру из 16 384 цветов. Для передачи снимки группируются в пакеты по 400 штук.
# Определите размер одного пакета фотографий в Мбайт.
#
# В ответе запишите целую часть полученного числа.
#
# Формула для определения объёма памяти, необходимого для хранения растрового изображения:
#
# V=h⋅w⋅i
from math import log2,ceil
i = ceil(log2(16384))
v = (1024*960*i)/8
p = v*400
print(p//2**20)
# Каждому изготовленному на заводе двигателю присваивается уникальный серийный номер,
# содержащий десятичные цифры и символы из 70-символьного специального алфавита.
# В базе данных каждый серийный номер занимает одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийный номеров,
# все символы кодируются одинаковым и минимально возможным числом бит. Известно,
# что 1 234 567 серийных номеров занимают более 24 Мбайт памяти.
#
# Определите минимально возможную длину серийного номера.
#
# Длина всего сообщения (L) вычисляется по формуле:
#
# L=Ii
#
# Здесь:
#
# I — объем сообщения (в битах)
#
# i — вес одного символа сообщения
#
# Для нахождения веса одного символа (i) можно воспользоваться такой формулой:
#
# i=log2N
i = ceil(log2(80))
I = ceil(1234567/(24*2**20*8))
L = I//i
print(L)
# Значение арифметического выражения 42022–6⋅4522+5⋅64510–3⋅2330−100
# записали в системе счисления с основанием 8. Определите количество цифр 7 в записи этого числа.
a = 4**2022-6*4**522+5*64**510-3*2**330-100
c =  0
while a:
    if a %8==7:
        c+=1
    a=a//8
print(c)
# Откройте файл 927.txt, содержащей вещественные числа
# — результаты ежечасного измерения концентрации примесей в воде очистных установок на протяжении трёх месяцев.
# Найдите количество значений концентраций,
# не совпадающих по значению ни с тремя минимальными,
# ни с тремя максимальными значениями, полученными за весь период наблюдений.
with open("927.txt",mode="r",encoding="utf-8") as f:
    f.readline()
    d = []
    for line in f:
        d.extend(list(map(float,line.split(),line.replace(",",".")[1:])))
s=sorted(d)
a = s[3:-3]
# c=0
# for in a:
#     c+=1
print(len(a))
# В файле 1720.txt содержится последовательность
# натуральных чисел. Её элементы могут принимать целые значения от 1 до 100 000 включительно.
# Определите количество пар последовательности,
# в которых остаток от деления хотя бы одного из элементов на 30 равен минимальному элементу последовательности.
# В ответе запишите количество найденных пар, затем минимальную из сумм элементов таких пар.
# В данной задаче под парой подразумевается два идущих подряд элемента
with open("1720.txt",mode="r",encoding="utf-8") as f:
    l = list(map(int,f))
d= []
for i in range(len(l)):
    a1 = l[i]
    a2 = l[i+1]
    if a1%30==min(l) or a2%30==min(l):
        d.append(a1+a2)
print(len(d),min(d))


