# Программа должна искать в строке последовательности 42, 8222 и 2222.
# Если найдено 42, она заменяет первое такое вхождение на 2. Если найдено 8222,
# она заменяет первое такое вхождение на 24. Если найдено 2222,
# она заменяет первое такое вхождение на 8. Цикл продолжается,
# пока в строке встречается хотя бы одна из этих цепочек.
# На вход приведённой выше программе поступает строка, начинающаяся с цифры «4»,
# а затем содержащая n цифр «2» (3 < n < 10 000). Определите наименьшее значение n,
# при котором сумма цифр в строке, получившейся в результате выполнения программы, равна 110.
# s = 0
# for n in range(4,10000):
#     a = "4" + "2" * n
#     while "42" in a or "8222" in a or "2222" in a:
#         a = a.replace("42","2",1)
#         a = a.replace("2222", "8",1)
#         a = a.replace("8222","24",1)
#     for  i in a:
#         s = s + int(i)
#     if s==110:
#         print(n)
#         break
# Программа должна искать в строке последовательности 31, 211 и 1111. Если найдено 31,
# она заменяет первое такое вхождение на 1. Если найдено 211, она заменяет первое такое вхождение на 13.
# Если найдено 1111, она заменяет первое такое вхождение на 2. Цикл продолжается, пока в строке встречается
# хотя бы одна из этих цепочек.
# На вход приведённой выше программе поступает строка, начинающаяся с цифры «3»,
# а затем содержащая n цифр «1» (3 < n < 10 000). Определите наименьшее значение n,
# при котором сумма цифр в строке, получившейся в результате выполнения программы, равна 15.
# s= 0
# for n in range(4,10000):
#     a = "3"+"1"*n
#     while "31" in a or "211" in a or "1111" in a:
#         a = a.replace("31","1",1)
#         a = a.replace("211","13",1)
#         a = a.replace("1111","2",1)
#     for i in a:
#         s= s + int(a)
#     if s == 15:
#         print(n)
#         break
# Программа должна искать в строке последовательности 111 и 88888. Если найдено 111,
# она заменяет первое такое вхождение на 88. Если 111 нет, но найдено 88888,
# она заменяет первое такое вхождение на 8. Цикл продолжается, пока в строке встречается хоть одна из этих цепочек.
# Какая строка получится в результате применения приведённой ниже программы к строке,
# состоящей из 81 идущей подряд цифры 1? В ответе запишите полученную строку.
# a = "1"*81
# while "111" in a or "88888" in a:
#     if "111" in a:
#         a=a.replace("111","88",1)
#     else:
#         a = a.replace("88888","8", 1)
# print(a)
# Программа должна искать в строке последовательности 33333 и 999. Если найдено 33333, она заменяет первое такое вхождение на 99. Если 33333 больше нет, но встречается 999, то первое такое вхождение заменяется на 3. Цикл работает, пока в строке остаётся хотя бы одна из этих цепочек.
# Какая строка получится в результате применения приведённой выше программы к строке, состоящей из 99 идущих подряд цифр 9? В ответе запишите полученную строку.
a ="9"*99
while "33333" in a or "999"in a:
        if "33333" in a:
            a=a.replace("33333","99",1)
        else:
            a = a.replace("999","3", 1)
print(a)