# 1.В файле 1705 содержится последовательность целых чисел.
# Её элементы могут принимать целые значения от –100 000 до 100 000 включительно.
#
# Определите количество пар последовательности, в которых хотя бы одно число отрицательно,
# а сумма чисел пары меньше количества чисел последовательности, кратных 32.
#
# Выведите на экран количество найденных пар, затем максимальную из сумм элементов таких пар.
# В данной задаче под парой подразумевается два идущих подряд элемента последовательности.
with open("1705.txt")as f:
    line = list(map(int,f))
c = []
for i in line:
    if i%32==0:
        c.append(i)
a = []
for el1,el2 in zip(line,line[1:]):
    if (el1<0 or el2<0) and (el1+el2)<len(c):
        a.append(el1+el2)
print(len(a),max(a))
# ответ 4969 299
# .В 1707 содержится последовательность целых чисел.
# Её элементы могут принимать целые значения от –100 000 до 100 000 включительно.
#
# Определите количество троек элементов последовательности, в которых произведение максимального
# и минимального элементов тройки больше суммы всех отрицательных элементов последовательности.
#
# В ответе запишите количество найденных троек, затем абсолютное значение максимальной
# из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.
with open("1707.txt") as f:
    line = list(map(int,f))
a = sum(i for i in line if i<0)
n = []
for a,b,c in zip(line,line[1:],line[2:]):
     if min(a,b,c)*max(a,b,c)>a:
         n.append(a+b+c)
print(len(n), max(n))
# ответ 4632 7953
# .В файле 1703.txt содержится последовательность целых чисел.
# Элементы последовательности могут принимать целые значения от —100 000 до 100 000 включительно.
#
# Определите количество троек элементов последовательности, в которых хотя бы
# один из трёх элементов оканчивается на 3,
# а сумма элементов тройки не больше максимального элемента последовательности,
# являющегося пятизначным числом, которое оканчивается на 3.
with open("1703.txt") as f:
    line = list(map(int,f))
c = []
for i in line:
    if 9999<abs(i)<100000 and abs(i)%10==3:
        c.append(i)
c1 = max(c)
n = []
for a,b,c in zip(line,line[1:],line[2:]):
    if abs(a)%10 == 3 or abs(b)%10 ==3 or abs(c)%10==3 and (a+b+c)<=c1:
        n.append(a+b+c)
print(len(n),max(n))
# ответ 1780 178243
# .В файле 1706.txt содержится последовательность целых чисел.
# Её элементы по модулю не превышают 100000 включительно.
#
# Определите количество троек элементов последовательности, в которых хотя бы один элемент оканчивается на 19
# и является пятизначным числом, а сумма всех элементов больше квадрата минимального элемента последовательности,
# оканчивающегося на 19 и являющегося трёхзначным числом.
#
# В ответе запишите количество найденных троек,
# затем минимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается
# три идущих подряд элемента последовательности.
with open("1706.txt") as f:
    line = list(map(int,f))
k = []
for i in line:
    if i%100==19 and 99<i<1000:
        k.append(i)
k1 = min(k)
n = 0
answer = []
for a,b,c in zip(line,line[1:],line[2:]):
    if (abs(a)%100 == 19 and 9999<abs(a)<100000)or(abs(b)%100 ==19 and 9999<abs(b)<100000)or (abs(c)%100==19and 9999<abs(c)<100000):
        n+=1
    if (a+b+c)>k1**2:
        n+=1
    if n==2:
        answer.append(a+b+c)
print(len(answer),max(answer))
# ответ 1 -38351



