# Пользователь вводит строку.
# Разделите её на две половины и выведите их в обратном порядке
# (сначала вторая, потом первая).
# a = input()
# b = len(a)//2
# c = a[b::] +a[:b]
# print(c)
# Пользователь вводит строку. Сформируйте строку, которая состоит из символов на чётных позициях
# в прямом порядке и символов на нечётных позициях в обратном.
# a = input()
# c = a[1::2]
# b = a[::2]
# print(b+ c[::-1])
# Пользователь вводит строку.
# Составьте новую строку, в которой каждая третья буква заменена на символ *.
a = input()
res = " "
for i in range(len(a)):
    if (i+1)%3==0:
        res = res+ "*"
    else:
        res=res + str([i])
print(res)
# Найдите в строке самую длинную подстроку,
# которая является палиндромом.
# Если таких несколько, выведите первую
# s = "дед, наган, стрелял ,по, манекенам"
# s =s.replace(" ","").split(",")
# for a in s:
#     if a == a[::-1]:
#         b = a
#         if len(a)>len(b):
#             b = a
# print(b)
# Пользователь вводит строку.
# Напишите программу, которая выводит поочерёдно:
#
# Символ, который встречается в строке чаще всего и количество его вхождений
# Каждый третий символ
# Самую длинную подстроку, расположенную между двумя повторяющимися символами
a = input()
print(a[2::3])
# подстрока
maxim=0
s =" "
result = " "
for i in range(len(a)):
    c = 0
    s = ""
    for j in range(i+1,len(a)):
        if a[i]==a[j]:
            if c>maxim:
                maxim=c
                result=s
        c = c + 1
        s+=a[j]
print(result)
# а встр
for i in range(len(a)):
    c= 1
    s = ""
    for j in range(i+1,len(a)):
        if a[i]==a[j]:
            c+=1
        if maxim<c:
            maxim=c
            result = a[i]
print(result,maxim)
