# Задание 1**
#
# **Файл 2615.txt**
#
#  Илье необходимо перенести файлы с одного компьютера на другой при помощи внешнего жёсткого диска.
#
# Объём диска может быть меньше, чем требуется для переноса всех файлов за один раз.
# Свободный объём на диске и размеры файлов известны.
#
# По заданной информации об объёме файлов на компьютере и свободном объёме на диске определите
# максимальное число файлов, которые могут быть перенесены за один раз на внешний жёсткий диск, а также максимальный размер файла,
# записанного на этот диск, при условии, что перенесено наибольшее число файлов.
# **Входные данные**
#
# В первой строке входного файла находятся два числа: S – размер свободного места на диске
# (натуральное число, не превышающее 100 000) и N – количество файлов,
# которые надо перенести (натуральное число, не превышающее 10 000).
# В следующих N строках находятся значения объёмов указанных файлов
# (все числа натуральные, не превышающие 100), каждое в отдельной строке.
# Запишите в ответе два числа:
# сначала наибольшее число файлов, которые могут быть перенесены на внешний жёсткий диск
# за один раз, затем максимальный размер перенесённого файла, при условии,
# что перенесено наибольшее возможное число файлов. Если вариантов переноса несколько,
# выберите тот, при котором будет перенесён наибольший файл.
with open("2615.txt")as f:
    a =f.readline()
    a1= list(map(int,a.split()))
    c = list(map(int,f))
c1 = sorted(c)
count=[c1[0]]
for i in c1[1:]:
    if sum(count)+i < a1[0]:
        count.append(i)
count = count[:-1]
for i in c1[::-1]:
    if i <= a1[0]-sum(count):
        count.append(i)
print(len(count),count[-1])
# ответ 3105 44
# Задание 2 - новый тип
#
# Файл 2621.txt
#
# На соревнованиях по спортивнориентированию каждый
# участник должен пройти маршрут, посещая контрольные точки.
# Все контрольные точки пронумерованы натуральными числами начиная с 1.
#
# В начале сезона соревнований каждому спортсмену присваивается уникальный номер
# — натуральное число, не превышающее 1 000 000. Жюри фиксирует факт прохождения спортсменом контрольной точки.
# На разных этапах соревнований спортсмен может посетить одну и ту же контрольную точку в произвольном порядке
# несколько раз или не посетить совсем.
#
# Тренер в конце сезона анализирует результаты этапов соревнования,
# чтобы выявить контрольную точку, которую посетило наибольшее число спортсменов с идущими подряд номерами.
# Определите максимальное число спортсменов с идущими подряд номерами и номер найденной контрольной точки.
#
# Если таких групп спортсменов несколько, укажите наименьший номер посещённой группой контрольной точки.
#
# Входные данные
#
# В первой строке входного файла находится число N (натуральное число, не превышающее 1 000 000)
# — количество посещений спортсменами контрольных точек в течение всего сезона соревнований.
# Каждая из следующих N строк содержит два натуральных числа, не превышающих 1 000 000:
# номер спортсмена и номер посещённой им контрольной точки.
#
# Запишите в ответе два целых неотрицательных числа:
# максимальное число спортсменов с идущими подряд номерами, посетивших одну и ту же точку,
# и номер этой точки.
# with open("2621.txt")as f:
#     a1 = int(f.readline())
#     c = []
#     for i in f:
#         k = list(map(int, i.split()))
#         b = {"номер спортсмена": k[0], "номер точки ": k[1]}
#         c.append(b)
# c1 = sorted(c,key = lambda x:(x["номер точки"],x["номер спортсмена"]))
# current = 1
# max_current = 0
# point = None
# for i in range(1,len(c1)):
#     if (c1[i-1]["номер спортсмена"] + 1 == c1[i]["номер спорстмена"]) and c1[i-1]["номер точик"]==c1[i]["номер точки"]:
#         current+=1
#         if current>max_current:
#             max_current = current
#             point=c1[i]["номер точки"]
#     else:
#         current=1
# print(max_current,point)


