# str = input()
# substr = input()
# def count(str,substr):
#     c = 0
#     a = 0
#     n = 0
#     if len(substr)>= len(str):
#         c = 0
#     for i in range(len(substr)):
#             if substr[n+i]==str[n+i]:
#                 a+=1
#                 if a==len(substr):
#                     c+=1
#                     n+=len(substr)
#  print(c)
# print(count(str,substr))
# Голосовое сообщение продолжительностью 2 минуты было записано в формате стерео и оцифровано с глубиной кодирования 24 бита и
# частотой дискретизации 72 000 измерений в секунду. Сжатие данных не использовалось.
# Файл с оцифрованным голосовым сообщением был передан по каналу связи, пропускная способность которого 48 000 бит/с.
# Сколько секунд длилась передача файла? В ответе запишите целое число, единицу измерения указывать не нужно.
# Формула для вычисления объема звукового файла следующая:
#
# V=k⋅t⋅i⋅η
#
# Где:
#
# k — количество каналов (1, 2 или 4);
#
# t — длительность записи в секундах;
#
# i — глубина кодирования в битах (разрешение);
#
# η – частота дискретизации в герцах.
#
# Для работы с передачей данных есть следующая формула:
#
# V=q⋅t
#
# Здесь:
#
# V — объем файла в битах,
#
# q — скорость передачи данных (бит в секунду),
#
# t — время в секундах.
v = 2*120*24*72000
t = v//48000
print(t)
# Татьяна фотографирует достопримечательности с помощью камеры смартфона.
# Каждая фотография представляет собой растровое изображение размером 2000х1000 пикселей, при этом используется палитра из 225 цветов
#
# В конце дня она отправляет снимки родственникам с помощью мессенджера.
# Для экономии трафика приложение оцифровывает снимки повторно, используя размер 800х700 пикселей и глубину цвета 15 бит.
#
# Сколько Кбайт трафика экономится при передачи 40 фотографий? В ответе укажите целую часть полученного числа.
a = ((2000*1000*log)//(800*700*2**15))*40
b = a//8
print(a//1000)
# ри регистрации в компьютерной системе каждому объекту присваивается идентификатор,
# состоящий из 317 символов и содержащий только десятичные цифры и
# символы из 4090-символьного специального алфавита. В базе данных для хранения каждого
# идентификатора отведено одинаковое и минимально возможное целое число байт.
# При этом используется посимвольное кодирование идентификаторов,
# все символы кодируются одинаковым и минимально возможным количеством бит.
# Определите объём памяти (в Мбайт), необходимый для хранения 262 144 идентификаторов.
#
# В ответе запишите только целое число – количество Мбайт.
#
# Объем всего сообщения (памяти) (I) вычисляется по формуле:
#
# I=L⋅i
#
# Здесь:
#
# L — длина сообщения (количество символов)
#
# i — вес одного символа сообщения
#
# Для нахождения веса одного символа (i) можно воспользоваться такой формулой:
#
# i=log2N
#
# Здесь:
#
# N — можность алфавита, то есть количество уникальных символов (например, 10 цифр, 26 букв латинского алфавита и т.д.)
from math import log2,ceil
i = ceil(log2(4100))
I= (317*i / 8)*262144
print(I//2**20)# из байт в мегабайты
with open("915.txt")as f:
    l = list(map(int,f.split()))
    for i in range


a = 2*2401525+3*343524-4*49523+5*49522-6*7521-35
c = 0
while a:
    if a%49<=9:
        c+=1
    num =num//49
with open("915.txt",mode="r",encoding="utf-8") as f:
    d =[]
    for line in f:
        l = list(map(int,line.split()))
        d.append(l)
def r1(line):
