# Если пользователь ввел значение до 7, то выводится строка "Дошкольник".
# Если пользователь ввел значение от 7 (включительно) до 18, то выводится строка "Школьник".
# Если пользователь ввел значение от 18 (включительно) до 22, то выводится строка "Студент".
# Если пользователь ввел значение от 22 (включительно) до 65, то выводится строка "Рабочий".
# Если введённое значение больше 65, то выводится строка "Пенсионер"
# a = int(input())
# if a < 7 :
#     print("Дошкольник")
# if 7<= a < 18:
#     print("Школьник")
# if 18<=a < 22 :
#     print("Студент")
# if 22<=a<65:
#     print("Рабочий")
# if a > 65:
#     print("Пенсионер")
# Пользователь вводит положительное целое трехзначное число.
# Если число содержит хотя бы одну из цифр 1,3,5,7, то оно выводится на экран
# В противном случае выводится сообщение "Число не содержит ни одну из цифр 1,3,5 или 7"
a = int(input())
b = a % 10
c = a % 100
c = c // 10
d = a // 100
if b == 1 or 3 or 5 or 7:
    print(a)
elif c == 1 or 3 or 5 or 7:
    print(a)
elif d == 1 or 3 or 5 or 7:
    print(a)
else:
    print("Число не содержит ни одну из цифр 1,3,5 или 7")

