# Дан список чисел:
# копировать
# undefined
# undefined
# nums = [5, 2, 9, 1, 5]
# #
# # Отсортируйте его по возрастанию с помощью sort() и выведите..sort()
# nums.sort()
# print(nums)
# Пользователь вводит список чисел в одну строку.
# Удалите все повторяющиеся элементы, сохранив порядок первого появления (не использовать множества).
# a = input()
# c = ""
# for i in a:
#     c = c + str(i)
#     if i in c:
#         a.remove(i)
# print(a)
# Дан список чисел. Найдите индекс первого локального максимума (элемент больше соседей)
# — пройдитесь циклом и используйте index() только в финальном выводе, если нужно показать индекс найденного значения.
# a= input()
# i = 0
# while i <a:
#     i
#     print(i)
# # Дан список чисел. Сделайте циклический сдвиг вправо на k позиций, используя только операции со срезами.
# a = input()
# print(a[])
# Дан список nums = [1,2,3,4,5,6]. Нужно удалить все вхождения элемента,
# равного среднему арифметическому (с округлением вниз до целого), и вывести новый список.
# from math import *
# nums = [1,2,3,4,5,6]
# c = floor((1+2+3+4+5+6)/6)
# for i in nums:
#     if i == c:
#         nums.remove(i)
# print(nums)
# Релизуйте алгоритм разложения любого, введённого пользователем, числа на разряды с использованием списков и циклов.
# Цифры каждого разряда должны быть представлены как элементы списка. Например: вводится число 12345, программа выводит на экран список [1, 2, 3, 4, 5].
a = int(input())
